[{"bio":"He is enthusiastic front-end developer who loves the web and new technologies around it. He is tech speaker, contributor, volunteer at Mozilla. He believes in the mission to ensure the Internet is a global public resource, open and accessible to all.","photo":"http://fsa.jsday.com.br/img/people/gabriel_micko.jpg","name":"Gabriel Mičko","position":"Mozilla","twitter":"https://twitter.com/gabriel_micko","facebook":"https://facebook.com/gabriel.micko","linkedin":"","github":""},{"bio":"Since 2009 at IBM as Cloud Technology Leader for Latin America, specialist in cloud computing, cognitive computing and Internet of Things. Today is the main evangelist of IBM Latin America for platform of digital innovation, acting as speaker in the main events, conferences and congress in Brazil and abroad, in companies and universities, also acts as mentor for hackathons, accelerators and incubators in Latin America.","photo":"http://fsa.jsday.com.br/img/people/sergiogama.jpg","name":"Sérgio Gama","position":"IBM","twitter":"","facebook":"","linkedin":"https://www.linkedin.com/in/sergiogama/","github":""},{"bio":"Entusiasta da open web e software livre. Software Developer na globo.com e membro da JS foundation. Já trabalhou como desenvolvedor em empresas como Videolog e Petrobras. Em 2015, foi um dos desenvolvedores de software mais notáveis no GitHub, tendo feito contribuições significativas para projetos de código aberto por 500 dias seguidos. Orador em mais de vinte conferências dando palestras sobre tecnologias web como JavaScript / ES6, Web Performance, React e Canvas / WebGL.","photo":"http://fsa.jsday.com.br/img/people/raphael.jpg","name":"Raphael Amorim","position":"Globo.com","twitter":"https://twitter.com/raphamundi","facebook":"","linkedin":"","github":""},{"bio":"Desenvolvedor na Jusbrasil, trabalha com Go, Python, Javascript, Kubernetes e outras tecnologias para construir aplicações performáticas e resilientes.","photo":"http://fsa.jsday.com.br/img/people/medina.jpg","name":"Andrews Medina","position":"Jusbrasil","twitter":"https://twitter.com/andrewsmedina","facebook":"","linkedin":"","github":""},{"bio":"É graduado em Ciência da Computação e pós-graduado em Computação Móvel. Empreendedor, autor de livros de programação e professor do ensino superior, trabalha há 11 anos com programação nas mais variadas plataformas e tecnologias e atualmente é evangelista técnico na Umbler","photo":"http://fsa.jsday.com.br/img/people/luiz.jpg","name":"Luiz Duarte","position":"Umbler","twitter":"https://twitter.com/luiztools","facebook":"","linkedin":"","github":""},{"bio":"Joselito Júnior é front-ender, community manager no GDG Recife, insturtor na Tampa Works, youtuber, podcaster, pernambucano e recifense. Sempre que sobra um tempinho, cria alguns projetos open source e contrubui em alguns outros, como o Brave Browser e o Ionic. É entrusiasta e usa no seu dia-a-dia PWA, Angular, Ionic, Preact, Next.js, Firebase, AMP e muitos outros pormenores. Já palestrou, organizou e contribuiu em eventos como DevFest, Campus Party, Code in the Dark, JSDay e Front Ins.","photo":"http://fsa.jsday.com.br/img/people/joselito.jpg","name":"Joselito Júnior","position":"Tampa Works","twitter":"https://twitter.com/joselitojunior1","facebook":"","linkedin":"","github":""},{"bio":"É desenvolvedor front-end no Jusbrasil, com experiência em diversas áreas como Telecom, E-commerce e E-learning, e trabalhou em diversos projetos em empresas como Oi, Vivo, Telebrás, Itaú, Hstern. É certificado Scrum Master, Product Owner e Developer pela Scrum Alliance e adora metodologias ágeis. Atualmente trabalha com Javascript utilizando a stack do Facebook React, Relay e Graphql.","photo":"http://fsa.jsday.com.br/img/people/pauloduarte.jpg","name":"Paulo Duarte","position":"JusBrasil","twitter":"https://www.twitter.com/paulopaquielli","facebook":"","linkedin":"","github":"https://github.com/paulopaquielli"},{"bio":"Feminista Negra que ama programação. Baiana. Familia de Irará. Uma ThoughtWorker com quase 7 anos de experiência na área de desenvolvimento. Curte programação Web, fullstack, backend. Se interessa por Arquitetura de Sistemas: Entrega de Software, um pouco de Infra, design de aplicações, segurança, e por ai vai.","photo":"http://fsa.jsday.com.br/img/people/roselma.jpg","name":"Roselma Mendes","position":"ThoughtWorks","twitter":"https://twitter.com/roselmamendes","facebook":"","linkedin":"","github":"https://github.com/roselmamendes"},{"bio":"Apaixonado por software livre, em especial JavaScript. Graduando em Engenharia de Computação pela UEFS. Trabalha no time de processamento de imagens de uma startup de Miami chamada AdMobilize. Desenvolvedor Node.js em uma startup de Feira de Santana chamada Tamse.","photo":"http://fsa.jsday.com.br/img/people/diegoleite.jpg","name":"Diego Leite","position":"AdMobilize","twitter":"https://twitter.com/di3goleite","facebook":"https://facebook.com/di3goleite","linkedin":"","github":"https://github.com/di3goleite"},{"bio":"Passionate father, a truly researcher and enthusiastic software developer. I am building web services, mobile apps and a life for my son.","photo":"http://fsa.jsday.com.br/img/people/matheuscardoso.jpeg","name":"Matheus Cardoso","position":"Z3 Web","twitter":"https://twitter.com/MatheusCAS","facebook":"","linkedin":"https://facebook.com/matheuscardoso","github":"https://github.com/matheuscas"},{"bio":"Amante de tecnologia e atualmente se aprofundando no mundo JavaScript. Graduando em Engenharia de Computação pela UEFS .Desenvolvedor na App2Sales com foco em mobile. Atual vice-presidente na EcompJr.","photo":"http://fsa.jsday.com.br/img/people/cassio.jpg","name":"Cássio Silva","position":"App2Sales","twitter":"","facebook":"https://www.facebook.com/ssscassio","linkedin":"","github":""},{"bio":"Estudante de engenharia de computação na UEFS, apaixonado por tecnologia e empreendedorismo trabalha como desenvolvedor mobile na App2Sales e é presidente da Empresa Júnior de Engenharia de Computação, sempre que pode posta uma resposta no StackOverflow.","photo":"http://fsa.jsday.com.br/img/people/pedro.jpg","name":"Pedro Neri","position":"App2Sales","twitter":"","facebook":"https://www.facebook.com/pedrolympio","linkedin":"","github":"https://github.com/Pedneri1"},{"bio":"Agitadora sócio-edu-biz-cultural em Salvador, promove e incentiva diversos projetos e inciativas para o empreendedorismo feminino, protagonismo de jovens de periferia, literatura e educação. Fundadora do Periféricas, têm estimulado mais participações de mulheres e meninas na tecnologia através de eventos e workshops de programação.","photo":"http://fsa.jsday.com.br/img/people/geisa.jpg","name":"Geisa Santos","position":"","twitter":"https://twitter.com/geisasantos","facebook":"","linkedin":"","github":""},{"bio":"O sagrado e o profano vão andando lado a lado. Autodidata, apaixonado por desenvolvimento web, amo JavaScript <3.","photo":"http://fsa.jsday.com.br/img/people/francisconeto.jpg","name":"Francisco Neto","position":"Lince Web","twitter":"","facebook":"https://www.facebook.com/uifrancisco","linkedin":"","github":""},{"bio":"Analista de TI na UFRB, organizador do GDG Feira de Santana e motociclista viajante","photo":"http://fsa.jsday.com.br/img/people/romualdoandre.jpg","name":"Romualdo André","position":"UFRB","twitter":"https://twitter.com/romualdoandre","facebook":"","linkedin":"https://br.linkedin.com/in/romualdo-andre-3072237","github":"https://github.com/romualdoandre"},{"bio":"Estudante de engenharia de computação da UFBA, entrei no mundo Front-end em 2013 e desde então procuro me aprofundar em Javascript e suas tecnologias.","photo":"http://fsa.jsday.com.br/img/people/clarabattesini.jpg","name":"Clara Battesini","position":"Cubos.io","twitter":"","facebook":"https://www.facebook.com/clara.battesini","linkedin":"","github":"https://github.com/clarabatt"},{"bio":"Desenvolvedor front-end na Cubos, apesar de ter alma de Humanas, focado em React e TypeScript, além de curioso por aprendizado de máquina. Mas, acima de tudo, amante de café e do Capão.","photo":"http://fsa.jsday.com.br/img/people/victor.jpg","name":"Victor Magalhães","position":"Cubos.io","twitter":"","facebook":"","linkedin":"","github":"https://github.com/vhfmag"},{"bio":"Graduando em Sistemas de Informação pela UNIFACS. Trabalha diariamente com JavaScript (NodeJS, Angular, React, Vue) na AdMobilize/Matrix Labs, empresa onde atua como Software Developer, desenvolvendo aplicações para IoT.","photo":"http://fsa.jsday.com.br/img/people/dilan.jpg","name":"Dilan Nery","position":"AdMobilize","twitter":"https://twitter.com/dilannery","facebook":"","linkedin":"","github":""},{"bio":"Desenvolvedor, maratonista, leitor. Graduando em Engenharia de Computação pela UEFS. Desenvolvedor na App2Sales.","photo":"http://fsa.jsday.com.br/img/people/lucascarneiro.jpg","name":"Lucas Carneiro","position":"App2Sales","twitter":"","facebook":"https://www.facebook.com/jkdrangel","linkedin":"","github":""},{"bio":"Sou Bacharel em Sistema de Informação pelo Centro Universitário Jorge Amado, líder da comunidade JavaBahia e FreeCodeCamp Salvador, membro ativo da comunidade SouJava e membro do JCP. Já participei de pesquisas na área de BioInformatica e hoje trabalho como um desenvolvedor Fullstack, participo da organizações de eventos, palestro, sou blogueiro e tenho me envolvido cada vez mais com JavaScript.","photo":"http://fsa.jsday.com.br/img/people/mateusmalaquias.jpg","name":"Mateus Malaquias","position":"PRODEB","twitter":"https://twitter.com/mmalaquias1","facebook":"https://www.facebook.com/mateus.malaquias2","linkedin":"https://www.linkedin.com/in/mateus-malaquias-692532b5/","github":"https://github.com/mmalaquias1"},{"bio":"Apaixonado pela web e o mundo open source, community manager no GDG Salvador e Fron in SSA, louco por café e futuro mochileiro.","photo":"http://fsa.jsday.com.br/img/people/marcus.jpg","name":"Marcus Silva","position":"GDG Salvador","twitter":"https://twitter.com/mvfsillva","facebook":"","linkedin":"","github":""}]
