[{"title":"Workshop: Iniciando com JavaScript (Turma 01)","theme":"O Curso Básico de JavaScript ajudará os alunos com os seus primeiros passos na linguagem mais utilizada do mundo. Será um momento de muito aprendizado e muita \"mão na massa\". Com esse curso, os participantes estarão aptos a trabalhar com desenvolvimento de aplicações web e manipulação do DOM com JavaScript. Teremos duas turmas, uma pela manhã e outra pela tarde.","lang":"pt-BR","complexity":"Beginner","name":"Romualdo André"},{"title":"Workshop: Iniciando com JavaScript (Turma 02)","theme":"O Curso Básico de JavaScript ajudará os alunos com os seus primeiros passos na linguagem mais utilizada do mundo. Será um momento de muito aprendizado e muita \"mão na massa\". Com esse curso, os participantes estarão aptos a trabalhar com desenvolvimento de aplicações web e manipulação do DOM com JavaScript. Teremos duas turmas, uma pela manhã e outra pela tarde.","lang":"pt-BR","complexity":"Beginner","name":"Romualdo André"},{"title":"Workshop: Transformando layouts em código","theme":"Colocando a Mão na Massa! Transformando layouts em código.  Você é aquela pessoa que quando tem um editor aberto da sua frente não sabe nem por onde começar? Tem dificuldade em colocar na prática tudo que aprendeu na parte teórica? Relaxe, você está no lugar certo! Nesse Workshop você vai colocar a mão na massa e desenvolver junto com a gente uma página do zero.  Recomendações: ","lang":"pt-BR","complexity":"Beginner","name":"Clara Battesini  Victor Magalhães"},{"title":"Change detection in Angular for Humans","theme":"It's not easy to understand change detection in Angular. Is about Zones, Observables, Threads that communicate among them, and some other dark matters. But for humans, we can talk about the how the different strategies works between components, pure and impure Pipes, how the components are connected to achieve a fast and predictable change detection and, of course, how to make an faster Angular application mixing these strategies. ","lang":"pt-BR","complexity":"Intermediate","name":"Matheus Cardoso"},{"title":"Desenvolvendo para Web utilizando NodeJS","theme":"","lang":"pt-BR","complexity":"Intermediate","name":"Diego Leite  Dilan Nery"},{"title":"Vue.js, o primo pobre","theme":"React isso, Angular aquilo. Seria interessante dar um pouco de espaço ao vue (https://vuejs.org) Afinal, tudo na vida tem que ter uma alternativa asiática.","lang":"pt-BR","complexity":"Intermediate","name":"Francisco Neto"},{"title":"Workshop: Iniciando no mundo mobile com React-Native","theme":"Nesse workshop aprenderemos os princípios do React-Native e como a programação mobile está a um passo de distância para quem tem conhecimento em js e front-end para web. Para treinar as suas habilidades, faremos um app parecido com o Instagram usando os conceitos aprendidos. O workshop será dividido em duas partes, uma pela manhã e outra pela tarde.","lang":"pt-BR","complexity":"Intermediate","name":"Cássio Silva  Lucas Carneiro"},{"title":"Apps mobile performáticos com Javascript","theme":"Seria possível desenvolver apps mobile para iOS e Android a partir de um único código fonte com performance nativa (ou superior) utilizando apenas seus conhecimentos de JavaScript para web? Descubra todo o poder que React Native tem e porque utilizá-lo no dia a dia da sua empresa.","lang":"pt-BR","complexity":"Intermediate","name":"Pedro Neri"},{"title":"Desenvolvimento Ágil com JavaScript","theme":"Algumas ferramentas e dicas para aumentar a sua produtividade e diminuir o tempo de deploy da sua aplicação para produção.","lang":"pt-BR","complexity":"Beginner","name":"Paulo Duarte"},{"title":"Node? JavaScript no servidor? WTF?","theme":"O que é Node.js? Por que utilizar JavaScript no lado do servidor? Como funciona? Escala? Qual a empresa por trás do projeto? É difícil? Onde posso aprender? Nesta palestra vamos entender melhor sobre essa plataforma de desenvolvimento que vem abrindo muitas portas no mercado e derrubando plataformas já consagradas.","lang":"pt-BR","complexity":"Beginner","name":"Mateus Malaquias"},{"title":"Escolha: quer seu webapp bonito, com SEO bom ou rápido? Tenha os três usando AMP.","theme":"Nessa talk você vai conhecer a fundo as Accelerated Mobile Pages, projeto Open Source endorsado pelo Google que permite a criação de páginas web com renderização praticamente instantânea. Saiba a fundo as novidades do projeto, como implementar no seu produto e as enormes vantagens que o AMP tem para o desenvolvimento de webapps.","lang":"pt-BR","complexity":"Intermediate","name":"Joselito Júnior"},{"title":"Understanding Memory Behavior on NodeJS","theme":"A ideia a palestra é falar sobre memória no nodejs (V8) e também sobre o spidermonkey[Firefox]), problemas comuns e mais complexos de leaks. Apresentando como debugar, detectar e resolver problemas com memória, além de mostrar casos reais de memory leaks da globo.com.","lang":"pt-BR","complexity":"Intermediate","name":"Raphael Amorim"},{"title":"Código Limpo","theme":"Escrever código é algo fácil o difícil é manter seu código limpo, legível por muito tempo sem transformá-lo em um código legado. Irei abordar várias práticas e princípios que nos ajudam a escrever e manter o código limpo.","lang":"pt-BR","complexity":"Intermediate","name":"Andrews Medina"},{"title":"Progressive Web Apps: the much-hyped future","theme":"Progressive Web Apps(PWA) são páginas web vitaminadas que graças aos ServiceWorkers e ao App Shell possibilitam uma experiência semelhante a um aplicativo nativo. Nessa palestra iremos descobrir como fazer PWAs utilizando React e entender como podemos mudar a forma que entregamos conteúdo aos usuários.","lang":"pt-BR","complexity":"Beginner","name":"Marcus Silva"},{"title":"Por que Stanford trocou Java por JavaScript?","theme":"Uma palestra de provocação para que a platéia pense sobre como ensinamos software hoje e como deveríamos estar ensinando amanhã, se quisermos que mais pessoas se interessem por programação (e porque isso é importante para o futuro).","lang":"pt-BR","complexity":"Beginner","name":"Luiz Duarte"},{"title":"Experiências interativas com p5.js","theme":"p5js é uma biblioteca JS que fornece um ambiente interativo e gráfico baseado nos princípios do Processing, linguaguem de programação voltada para criativos e artistas. Nesta talk você vai conhecer um case que une jogos, interatividade e ativismo.","lang":"pt-BR","complexity":"Beginner","name":"Geisa Santos"},{"title":"Docker no desenvolvimento Web","theme":"Cada vez mais vemos a comunidade de desenvolvimento de software falar mais e mais sobre como entregar software de maneira rápida e com qualidade, onde DevOps, Entrega e Integração Contínua fazem parte dessas discussões. Baseado nisso, Docker se tornou uma das palavras do momento. Depois do uso das máquinas virtuais, atualmente tem se falado muito da conteinerização das aplicações. A idéia é mostrar como usar docker em uma aplicação React com um servidor ExpressJS. Serão abordados temas de \"mount volume\", docker-compose, testes em containers, deploy com docker, práticas para dockerizar aplicações web. E a pergunta de 1 milhão de dólares para que serve esse Docker e quais as vantagens de usar ele. Entenda em como \"dockerizar\" uma aplicação pode ajudar no desenvolvimento e na entrega dela.","lang":"pt-BR","complexity":"Intermediate","name":"Roselma Mendes"},{"title":"WebRTC From Zero to Hero","theme":"The presentation covers the main pillars of WebRTC which is video - audio calling and file sharing. It includes a well prepared demo with interaction with the audience, top-notch news and help to get started.","lang":"en","complexity":"Advanced","name":"Gabriel Mičko"},{"title":"GraphQL beyond the limit","theme":"The presentation covers an introduction to the GraphQL query language, explaining its features and benefits. I will show how minimal investment you have to do to start up your GraphQL endpoint without having to rewrite your entire database infrastructure. The workshop includes live demonstration (live coding).","lang":"en","complexity":"Advanced","name":"Gabriel Mičko"},{"title":"Transformação Digital e IoT com sistemas cognitivos","theme":"","lang":"pt-BR","complexity":"Intermediate","name":"Sérgio Gama"}]
